___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [12]:
import pandas as pd
import numpy as np

In [20]:
from numpy.random import rand
np.random.seed(101)

In [21]:
df = pd.DataFrame(rand(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [22]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [23]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [26]:
df['W']

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [27]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.516399  0.171522
B  0.685277  0.893613
C  0.721544  0.352132
D  0.181892  0.232354
E  0.083561  0.276239

In [28]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

DataFrame Columns are just Series

In [29]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [33]:
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.544873
B  0.685277  0.833897  0.306966  0.893613  0.992243
C  0.721544  0.189939  0.554228  0.352132  1.275771
D  0.181892  0.785602  0.965483  0.232354  1.147376
E  0.083561  0.603548  0.728993  0.276239  0.812554

** Removing Columns**

In [36]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [37]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.544873
B  0.685277  0.833897  0.306966  0.893613  0.992243
C  0.721544  0.189939  0.554228  0.352132  1.275771
D  0.181892  0.785602  0.965483  0.232354  1.147376
E  0.083561  0.603548  0.728993  0.276239  0.812554

In [38]:
df.drop('new',axis=1,inplace=True)

In [39]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

Can also drop rows this way:

In [40]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

** Selecting Rows**

In [41]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [43]:
df.loc['A']

W    0.516399
X    0.570668
Y    0.028474
Z    0.171522
Name: A, dtype: float64

Or select based off of position instead of label

In [45]:
df.iloc[2]

W    0.721544
X    0.189939
Y    0.554228
Z    0.352132
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [46]:
df.loc['B','Y']

0.3069662196722378

In [47]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.516399  0.028474
B  0.685277  0.306966

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [48]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [49]:
df>0

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [50]:
df[df>0]

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [51]:
df[df['W']>0]

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [52]:
df[df['W']>0]['Y']

A    0.028474
B    0.306966
C    0.554228
D    0.965483
E    0.728993
Name: Y, dtype: float64

In [53]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.028474  0.570668
B  0.306966  0.833897
C  0.554228  0.189939
D  0.965483  0.785602
E  0.728993  0.603548

For two conditions you can use | and & with parenthesis:

In [54]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [55]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [62]:
df[df['Z']<0.5]

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [63]:
df['Z'].dtype

dtype('float64')

In [64]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.516399  0.570668  0.028474  0.171522
1     B  0.685277  0.833897  0.306966  0.893613
2     C  0.721544  0.189939  0.554228  0.352132
3     D  0.181892  0.785602  0.965483  0.232354
4     E  0.083561  0.603548  0.728993  0.276239

In [68]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [73]:
newind = 'CA NY WY OR CO'.split()

In [74]:
df['States'] = newind

In [75]:
df

          W         X         Y         Z States
A  0.516399  0.570668  0.028474  0.171522     CA
B  0.685277  0.833897  0.306966  0.893613     NY
C  0.721544  0.189939  0.554228  0.352132     WY
D  0.181892  0.785602  0.965483  0.232354     OR
E  0.083561  0.603548  0.728993  0.276239     CO

In [76]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.516399  0.570668  0.028474  0.171522
NY      0.685277  0.833897  0.306966  0.893613
WY      0.721544  0.189939  0.554228  0.352132
OR      0.181892  0.785602  0.965483  0.232354
CO      0.083561  0.603548  0.728993  0.276239

In [77]:
df

          W         X         Y         Z States
A  0.516399  0.570668  0.028474  0.171522     CA
B  0.685277  0.833897  0.306966  0.893613     NY
C  0.721544  0.189939  0.554228  0.352132     WY
D  0.181892  0.785602  0.965483  0.232354     OR
E  0.083561  0.603548  0.728993  0.276239     CO

In [78]:
df.set_index('States',inplace=True)

In [79]:
df

               W         X         Y         Z
States
CA      0.516399  0.570668  0.028474  0.171522
NY      0.685277  0.833897  0.306966  0.893613
WY      0.721544  0.189939  0.554228  0.352132
OR      0.181892  0.785602  0.965483  0.232354
CO      0.083561  0.603548  0.728993  0.276239

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [86]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index_ = pd.MultiIndex.from_tuples(hier_index)

In [87]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [88]:
hier_index_

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [91]:
a= [['G1', 'G2'], [1, 2, 3]]

In [93]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index_,columns=['A','B'])
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [260]:
df.loc['G1']

          A         B
1  0.153661  0.167638
2 -0.765930  0.962299
3  0.902826 -0.537909

In [263]:
df.loc['G1'].loc[1]

A    0.153661
B    0.167638
Name: 1, dtype: float64

In [265]:
df.index.names

FrozenList([None, None])

In [266]:
df.index.names = ['Group','Num']

In [267]:
df

                  A         B
Group Num
G1    1    0.153661  0.167638
      2   -0.765930  0.962299
      3    0.902826 -0.537909
G2    1   -1.549671  0.435253
      2    1.259904 -0.447898
      3    0.266207  0.412580

In [270]:
df.xs('G1')

            A         B
Num
1    0.153661  0.167638
2   -0.765930  0.962299
3    0.902826 -0.537909

In [271]:
df.xs(['G1',1])

A    0.153661
B    0.167638
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

# Great Job!